---
kind: method
id: M:Autodesk.Revit.DB.ExportLineweightTable.ContainsKey(Autodesk.Revit.DB.ExportLineweightKey)
source: html/82c33025-cb7b-f359-feca-1cb366e6d626.htm
---
# Autodesk.Revit.DB.ExportLineweightTable.ContainsKey Method

Checks whether a line weight key exists in the table.

## Syntax (C#)
```csharp
public bool ContainsKey(
	ExportLineweightKey exportLineweightKey
)
```

## Parameters
- **exportLineweightKey** (`Autodesk.Revit.DB.ExportLineweightKey`) - The export line weight key.

## Returns
True if the line weight exists in the table.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null